import os

file_paths = [
    "./为王问鼎,择日登基/为王问鼎,择日登基.mp4",
    "./了不起的妈妈/了不起的妈妈.mp4",
    "./以我晚星映海川/以我晚星映海川.mp4",
    "./傻了吧我有,一屋子美女房客/傻了吧我有,一屋子美女房客.mp4",
    "./命中注定我爱你/命中注定我爱你.mp4",
    "./工业之光/工业之光.mp4",
    "./愤怒的父亲/愤怒的父亲.mp4",
    "./我们都要活下去/我们都要活下去.mp4",
    "./我的傻父/我的傻父.mp4",
    "./浪子回头,浪子回头金不换/浪子回头,浪子回头金不换.mp4",
    "./爱意随风起/爱意随风起.mp4",
    "./闪婚对象竟是豪门大佬/闪婚对象竟是豪门大佬.mp4",
    "./闪婚老公竟想凭子上位/闪婚老公竟想凭子上位.mp4",
    "./隐婚后,我的下属老公掉马甲了/隐婚后,我的下属老公掉马甲了.mp4",
    "./青春不死常胜不衰/青春不死常胜不衰.mp4"
]

names = []

for path in file_paths:
    # 提取文件名称部分
    file_name = os.path.basename(path)
    # 去掉扩展名
    name, ext = os.path.splitext(file_name)
    # 添加到名称列表
    names.append(name)

# 打印以逗号分隔的文件名称
print(", ".join(f"'{name}'" for name in names))
